In [1]:
import pandas as pd

In [2]:
datos = pd.read_csv("../datos/clientes.csv")
datos

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
2      NaN  70.0  20000.0
3   Carmen  49.0  22000.0
4      NaN   NaN      NaN
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [13]:
datos[~datos["nombre"].isnull()]

    nombre  edad  ingreso
0     Juan  35.0  15800.0
1    Luisa  25.0  17000.0
3   Carmen  49.0  22000.0
5    Mario  30.0  15800.0
6    Pedro   NaN  17400.0
7  Gustavo  27.0      NaN
8   Carlos   NaN      NaN

In [9]:
datos[datos["nombre"].isnull()]

  nombre  edad  ingreso
2    NaN  70.0  20000.0
4    NaN   NaN      NaN

In [10]:
datos.dropna()

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0

In [15]:
datos.dropna(subset=["nombre","ingreso"])

   nombre  edad  ingreso
0    Juan  35.0  15800.0
1   Luisa  25.0  17000.0
3  Carmen  49.0  22000.0
5   Mario  30.0  15800.0
6   Pedro   NaN  17400.0

In [17]:
datos["nombre"].fillna("Desconocido")

0           Juan
1          Luisa
2    Desconocido
3         Carmen
4    Desconocido
5          Mario
6          Pedro
7        Gustavo
8         Carlos
Name: nombre, dtype: object

In [19]:
valores_defecto = {"nombre":"Desconocido", "edad":0, "ingreso":"10000"}
datos.fillna(value=valores_defecto)

        nombre  edad  ingreso
0         Juan  35.0  15800.0
1        Luisa  25.0  17000.0
2  Desconocido  70.0  20000.0
3       Carmen  49.0  22000.0
4  Desconocido   0.0    10000
5        Mario  30.0  15800.0
6        Pedro   0.0  17400.0
7      Gustavo  27.0    10000
8       Carlos   0.0    10000

In [22]:
promedio = datos["ingreso"].mean()
promedio

18000.0

In [23]:
mediana = datos["ingreso"].median()
mediana

17200.0

In [25]:
moda = datos["ingreso"].mode()[0]
moda

15800.0

In [26]:
datos["ingreso"].fillna(moda)

0    15800.0
1    17000.0
2    20000.0
3    22000.0
4    15800.0
5    15800.0
6    17400.0
7    15800.0
8    15800.0
Name: ingreso, dtype: float64